<?php

$city = [
    'Московская область' => [
        'Москва',
        'Зеленоград',
        'Клин'
    ],
    'Ленинградская область' => [
        'Санкт-Петербург',
        'Всеволожск',
        'Павловск',
        'Кронштадт'
    ],
    'Рязанская область' => [
        'Касимов',
        'Рязань',
        'Скопин',
        'Шацк'
    ]
];

foreach ($city as $region => $regionName) {
    echo "\n$region: \n";
    foreach ($regionName as $cities) {
        if (substr($cities, 0, 2) == 'К') echo $cities;
    }
}